MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK60DN512ZVMD10/mcu.h
#define GROUP1                        0x780000000      // Controls the multiplexing of the FB_ALE, FB_CS1, and FB_TS signals.
#define GROUP2                        0x78000000      // Controls the multiplexing of the FB_CS4, FB_TSIZ0, and FB_BE_31_24 signals.


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_CRC register.
//
//*****************************************************************************

#define HU                            0x7F80000000      // CRC High Upper Byte
#define HL                            0x7F800000      // CRC High Lower Byte
#define LU                            0x007F8000      // CRC Low Upper Byte
#define LL                            0x00007F80      // CRC Low Lower Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_GPOLY register.
//
//*****************************************************************************

#define HIGH                          0x7FFF80000000      // High polynominal half-word
#define LOW                           0x7FFF8000      // Low polynominal half-word


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_CTRL register.
//
//*****************************************************************************

#define TOT                           0x180000000      // Type of Transpose for Writes
#define TOTR                          0x60000000      // Type of Transpose for Read
#define FXOR                          0x04000000      // Complement Read of CRC data register
#define WAS                           0x02000000      // Write CRC data register as seed


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CASR register.
//
//*****************************************************************************

#define VER                           0x780000000      // CAU version
#define DPE                           0x00000002      // DES parity error
#define IC                            0x00000001      // Illegal command


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CAA register.
//
//*****************************************************************************

#define ACC                           0x7FFFFFFF80000000      // Accumulator


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CAn register.
//
//*****************************************************************************

#define CAn                           0x7FFFFFFF80000000      // General purpose registers ::


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_VER register.
//
//*****************************************************************************

#define TYPE                          0x780000000      // Random number generator type
#define MAJOR                         0x007F8000      // Major version number
#define MINOR                         0x00007F80      // Minor version number


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_CMD register.
//
//*****************************************************************************

#define SR                            0x00000040      // Software reset
#define CE                            0x00000020      // Clear error
#define CI                            0x00000010      // Clear interrupt
#define GS                            0x00000002      // Generate seed
#define ST                            0x00000001      // Self test


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_CR register.
//
//*****************************************************************************

#define MASKERR                       0x00000040      // Mask error interrupt
#define MASKDONE                      0x00000020      // Mask done interrupt
#define AR                            0x00000010      // Auto-reseed
#define FUFMOD                        0x00000006      // FIFO underflow response mode


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_SR register.
//
//*****************************************************************************

#define STATPF                        0x7F80000000      // Statistics test pass fail
#define ST_PF                         0x03800000      // Self Test Pass Fail
#define ERR                           0x00010000      // Error
#define FIFO_SIZE                     0x00078000      // FIFO size
#define FIFO_LVL                      0x00007800      // FIFO level
#define NSDN                          0x00000040      // New seed done
#define SDN                           0x00000020      // Seed done
#define STDN                          0x00000010      // Self test done
#define RS                            0x00000008      // Reseed needed
#define SLP                           0x00000004      // Sleep
#define BUSY                          0x00000002      // Busy


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_ESR register.
//
//*****************************************************************************

#define FUFE                          0x00000010      // FIFO underflow error
#define SATE                          0x00000008      // Statistical test error
#define STE                           0x00000004      // Self test error
#define OSCE                          0x00000002      // Oscillator error
#define LFE                           0x00000001      // Linear feedback shift register (LFSR) error


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_OUT register.
//
//*****************************************************************************

#define RANDOUT                       0x7FFFFFFF80000000      // Random Output


//*****************************************************************************
//
// The following are defines for the bit fields in the VREF_TRM register.
//
//*****************************************************************************

#define TRIM                          0x000007E0      // Trim bits


//*****************************************************************************
//
// The following are defines for the bit fields in the VREF_SC register.
//
//*****************************************************************************

